baotrinhnz/xiaozhi-esp32/main/boards/espressif/esp-vocat/esp_vocat.cc
        bool codec_alive = (i2c_master_probe(i2c_bus_, 0x18, 100) == ESP_OK);
        uint8_t pcb_version = 0;
        if (codec_alive) {
            ESP_LOGI(TAG, "PCB version V1.0");
            pcb_version = 0;
        } else {
            ESP_ERROR_CHECK(gpio_set_level(CORDEC_POWER_CTRL, 1));
            vTaskDelay(pdMS_TO_TICKS(50));
            codec_alive = (i2c_master_probe(i2c_bus_, 0x18, 100) == ESP_OK);
            if (codec_alive) {
                ESP_LOGI(TAG, "PCB version V1.2");
                pcb_version = 1;
                AUDIO_I2S_GPIO_DIN = AUDIO_I2S_GPIO_DIN_2;
                AUDIO_CODEC_PA_PIN = AUDIO_CODEC_PA_PIN_2;
                QSPI_PIN_NUM_LCD_RST = QSPI_PIN_NUM_LCD_RST_2;
                TOUCH_PAD2 = TOUCH_PAD2_2;
                UART1_TX = UART1_TX_2;
                UART1_RX = UART1_RX_2;
            } else {
                ESP_LOGE(TAG, "PCB version detection error");
            }
        }
        return pcb_version;
    }

    static void touch_isr_callback(void* arg) {
        Cst816s* touchpad = static_cast<Cst816s*>(arg);
        if (touchpad != nullptr) {
            touchpad->NotifyTouchEvent();
        }
    }

    // Tải ảnh JPEG từ 1 URL -> hiện lên màn (đè mặt mèo). Trả true nếu hiện được.
    bool FetchUrlAndShow(const char* url) {
        auto* disp = dynamic_cast<emote::EmoteDisplay*>(display_);
        if (disp == nullptr) return false;
        esp_http_client_config_t cfg = {};
        cfg.url = url;
        cfg.timeout_ms = 8000;
        esp_http_client_handle_t c = esp_http_client_init(&cfg);
        if (c == nullptr) return false;
        bool ok = false;
        uint8_t* buf = nullptr;
        do {
            if (esp_http_client_open(c, 0) != ESP_OK) break;
            int clen = esp_http_client_fetch_headers(c);
            if (clen <= 0 || clen > 200000) break;
            char* cnt = nullptr;
            if (esp_http_client_get_header(c, "X-Panel-Count", &cnt) == ESP_OK && cnt) {
                int v = atoi(cnt);
                if (v > 0) panel_count_ = v;
            }
            buf = (uint8_t*)malloc(clen);
            if (buf == nullptr) break;
            int off = 0, r = 0;
            while (off < clen && (r = esp_http_client_read(c, (char*)buf + off, clen - off)) > 0) {
                off += r;
            }
            if (off == clen && disp->ShowPanelImage(buf, clen)) {
                panel_active_ = true;
                StopViz();          // panel (lịch...) đè lên -> tạm dừng visualizer kẻo bars đè lên panel
                ok = true;
            }
        } while (0);
        if (buf) free(buf);
        esp_http_client_close(c);
        esp_http_client_cleanup(c);
        return ok;
    }

    // Tải ảnh page thứ n từ NAS (/panel?mac=<mac mèo>&n=) -> hiện lên màn (đường VUỐT).
    void FetchAndShowPanel(int n) {
        uint8_t mac[6] = {0};
        esp_read_mac(mac, ESP_MAC_WIFI_STA);
        char url[160];
        snprintf(url, sizeof(url), "%s/panel?mac=%02x:%02x:%02x:%02x:%02x:%02x&n=%d",
                 PANEL_HOST, mac[0], mac[1], mac[2], mac[3], mac[4], mac[5], n);
        FetchUrlAndShow(url);
    }

    // Fetch+decode blocking vài giây -> KHÔNG chạy trong callback MCP (task chính); đẩy sang task riêng.
    struct PanelFetchReq { EspVocat* self; char url[200]; };
    static void PanelFetchTask(void* arg) {
        auto* rq = static_cast<PanelFetchReq*>(arg);
        rq->self->FetchUrlAndShow(rq->url);
        free(rq);
        vTaskDelete(nullptr);
    }

    // Tải bìa JPEG (đã resize sẵn ở HomeCenter) -> hiện lên đỉnh màn media (KHÔNG đè mặt mèo — media tự ẩn mặt).
    bool FetchUrlAndShowCover(const char* url) {
        auto* disp = dynamic_cast<emote::EmoteDisplay*>(display_);
        if (disp == nullptr) return false;
        esp_http_client_config_t cfg = {};
        cfg.url = url;
        cfg.timeout_ms = 8000;
        esp_http_client_handle_t c = esp_http_client_init(&cfg);
        if (c == nullptr) return false;
        bool ok = false;
        uint8_t* buf = nullptr;
        do {
            if (esp_http_client_open(c, 0) != ESP_OK) break;
            int clen = esp_http_client_fetch_headers(c);
            if (clen <= 0 || clen > 200000) break;
            buf = (uint8_t*)malloc(clen);
            if (buf == nullptr) break;
            int off = 0, r = 0;
            while (off < clen && (r = esp_http_client_read(c, (char*)buf + off, clen - off)) > 0) {
                off += r;
            }
            if (off == clen && media_active_ && disp->ShowMediaCover(buf, clen)) ok = true;
        } while (0);
        if (buf) free(buf);
        esp_http_client_close(c);
        esp_http_client_cleanup(c);
        return ok;
    }
    static void MediaCoverFetchTask(void* arg) {
        auto* rq = static_cast<PanelFetchReq*>(arg);
        rq->self->FetchUrlAndShowCover(rq->url);
        free(rq);
        vTaskDelete(nullptr);
    }

    // ---- Màn MEDIA native: tên (cuộn mượt) + giờ (tick trên máy). Bỏ refresh ảnh -> không tải server, không giựt audio. ----
    static void FmtTime(char* buf, size_t n, int s) {
        if (s < 0) s = 0;
        if (s < 3600) snprintf(buf, n, "%d:%02d", s / 60, s % 60);
        else snprintf(buf, n, "%d:%02d:%02d", s / 3600, (s % 3600) / 60, s % 60);
    }

    void UpdateMediaTimeLabel() {
        auto* disp = dynamic_cast<emote::EmoteDisplay*>(display_);
        if (disp == nullptr || !media_active_) return;
        int pos = media_pos0_ + (int)((esp_timer_get_time() - media_t0_us_) / 1000000);
        if (media_dur_ > 0 && pos > media_dur_) pos = media_dur_;
        char a[16], b[16], line[96];
        FmtTime(a, sizeof(a), pos);
        FmtTime(b, sizeof(b), media_dur_);
        if (!media_bar_on_ && media_artist_[0]) {            // NHẠC: "ca sĩ · đã nghe" (hiện tên ca sĩ trên màn)
            snprintf(line, sizeof(line), "%s \xC2\xB7 %s", media_artist_, a);   // \xC2\xB7 = ' · '
        } else {
            snprintf(line, sizeof(line), "%s / %s", a, b);   // SÁCH: "đã nghe / tổng"
        }
        // Thanh progress MỊN: mỗi ô 2 mức nhờ khối NỬA ▌ -> 2*CELLS mức (mịn gấp đôi 10 ô đặc).
        // UTF-8: █=E2 96 88 (đầy), ▌=E2 96 8C (nửa trái), ░=E2 96 91 (rỗng).
        const int CELLS = 12;
        int halves = (media_dur_ > 0) ? (int)(((int64_t)2 * CELLS * pos + media_dur_ / 2) / media_dur_) : 0;
        if (halves < 0) halves = 0;
        if (halves > 2 * CELLS) halves = 2 * CELLS;
        int full = halves / 2, half = halves % 2;
        char bar[CELLS * 3 + 4]; int bp = 0;
        for (int i = 0; i < full; i++) { bar[bp++] = '\xE2'; bar[bp++] = '\x96'; bar[bp++] = '\x88'; }        // █
        if (half && full < CELLS) { bar[bp++] = '\xE2'; bar[bp++] = '\x96'; bar[bp++] = '\x8C'; }             // ▌
        for (int i = full + half; i < CELLS; i++) { bar[bp++] = '\xE2'; bar[bp++] = '\x96'; bar[bp++] = '\x91'; }  // ░
        bar[bp] = 0;
        emote_handle_t h = disp->GetEmoteHandle();
        emote_lock(h);
        if (media_time_ != nullptr) gfx_label_set_text(media_time_, line);
        if (media_bar_on_ && media_bar_fg_ != nullptr) gfx_label_set_text(media_bar_fg_, bar);
        emote_unlock(h);
        emote_notify_all_refresh(h);
    }

    static void MediaTickCb(void* arg) { static_cast<EspVocat*>(arg)->UpdateMediaTimeLabel(); }

    // ---- Visualizer nhạc: mỗi frame đọc mức âm -> cập nhật cột (lên ngay, rơi từ từ) -> vẽ RGB565 -> ShowViz ----
    static inline uint16_t VizRgb565(uint8_t r, uint8_t g, uint8_t b) {
        return (uint16_t)(((r & 0xF8) << 8) | ((g & 0xFC) << 3) | (b >> 3));
    }
    void VizTick() {
        auto* disp = dynamic_cast<emote::EmoteDisplay*>(display_);
        if (disp == nullptr || !media_active_ || viz_buf_ == nullptr) return;
        float lvl = vocat_audio_peak() / 32768.0f;
        if (lvl > 1.0f) lvl = 1.0f;
        lvl = powf(lvl, 0.55f);                                   // nén cho mức nhỏ cũng thấy
        for (int b = 0; b < VIZ_N; b++) {
            float shape = 0.55f + 0.45f * sinf(3.14159f * (b + 0.5f) / VIZ_N);   // giữa cao, mép thấp
            float flick = 0.75f + 0.25f * ((esp_random() & 0xFF) / 255.0f);
            float target = lvl * shape * flick;
            if (target > 1.0f) target = 1.0f;
            if (target > viz_bars_[b]) {
                viz_bars_[b] = target;                            // lên ngay
            } else {
                viz_bars_[b] -= 0.05f;                            // rơi từ từ
                if (viz_bars_[b] < 0) viz_bars_[b] = 0;
            }
            if (viz_bars_[b] > viz_peak_[b]) {
                viz_peak_[b] = viz_bars_[b];                      // chấm đỉnh nhảy lên theo cột
            } else {
                viz_peak_[b] -= 0.018f;                           // rồi rơi CHẬM hơn cột -> tách ra "tung lên rớt xuống"
                if (viz_peak_[b] < viz_bars_[b]) viz_peak_[b] = viz_bars_[b];
            }
        }
        for (int i = 0; i < VIZ_W * VIZ_H; i++) viz_buf_[i] = 0;  // nền đen
        int bw = VIZ_W / VIZ_N;
        int bar_w = bw - 3;                                       // hở khe giữa cột
        const uint16_t DOT = __builtin_bswap16(VizRgb565(0xFF, 0xFF, 0xFF));   // chấm đỉnh trắng nổi bật
        for (int b = 0; b < VIZ_N; b++) {
            int hh = (int)(viz_bars_[b] * (VIZ_H - 4));
            if (hh < 1 && viz_bars_[b] > 0.02f) hh = 1;
            int x0 = b * bw + 1;
            for (int y = VIZ_H - hh; y < VIZ_H; y++) {
                float t = (float)(VIZ_H - y) / (float)VIZ_H;      // đỉnh nhạt, đáy đậm
                uint16_t c = __builtin_bswap16(VizRgb565(
                    (uint8_t)(0x40 + 0x70 * t), (uint8_t)(0xC0 + 0x30 * t), (uint8_t)(0xB0 + 0x40 * t)));
                uint16_t* row = viz_buf_ + y * VIZ_W + x0;
                for (int x = 0; x < bar_w; x++) row[x] = c;
            }
            // chấm đỉnh 3px (trắng): giữ đỉnh rồi rơi CHẬM hơn cột -> tách ra khi cột tụt (tung lên rớt xuống)
            int py = VIZ_H - 2 - (int)(viz_peak_[b] * (VIZ_H - 4));
            if (viz_peak_[b] > 0.02f) {
                for (int dy = 0; dy < 3; dy++) {
                    int yy = py + dy;
                    if (yy < 0 || yy >= VIZ_H) continue;
                    uint16_t* row = viz_buf_ + yy * VIZ_W + x0;
                    for (int x = 0; x < bar_w; x++) row[x] = DOT;
                }
            }
        }
        disp->ShowViz(viz_buf_, VIZ_W, VIZ_H, 138);              // khu đáy (vùng tối của nền)
    }
    // Task riêng (KHÔNG chạy vẽ nặng trong esp_timer callback). CHÍNH task tự ẩn viz khi viz_run_=false ->
    // tránh race "ẩn chéo luồng" làm frame dở ShowViz lại đè -> viz kẹt sau khi ngừng nhạc.
    static void VizTaskLoop(void* arg) {
        auto* self = static_cast<EspVocat*>(arg);
        bool shown = false;
        while (true) {
            if (self->viz_run_ && self->media_active_) {
                self->VizTick();
                shown = true;
            } else if (shown) {
                auto* d = dynamic_cast<emote::EmoteDisplay*>(self->display_);
                if (d != nullptr) d->HideViz();
                shown = false;
            }
            vTaskDelay(pdMS_TO_TICKS(66));                        // ~15 fps
        }
    }
    void StartViz() {
        if (viz_buf_ == nullptr) {
            viz_buf_ = (uint16_t*)heap_caps_malloc(VIZ_W * VIZ_H * 2, MALLOC_CAP_SPIRAM);
            if (viz_buf_ == nullptr) viz_buf_ = (uint16_t*)malloc(VIZ_W * VIZ_H * 2);
        }
        if (viz_buf_ == nullptr) return;
        for (int b = 0; b < VIZ_N; b++) { viz_bars_[b] = 0; viz_peak_[b] = 0; }
        viz_run_ = true;
        if (viz_task_ == nullptr) {
            xTaskCreatePinnedToCore(VizTaskLoop, "media_viz", 3 * 1024, this, 3, &viz_task_, 0);
        }
    }
    void StopViz() { viz_run_ = false; }   // chính task VizTaskLoop sẽ HideViz ở tick kế (không ẩn chéo luồng)

    void ShowMedia(const char* title, const char* author, int pos, int dur, const char* cover_url, bool show_bar) {
        auto* disp = dynamic_cast<emote::EmoteDisplay*>(display_);
        if (disp == nullptr) return;
        emote_handle_t h = disp->GetEmoteHandle();
        if (h == nullptr) return;
        bool has_cover = (cover_url != nullptr && cover_url[0] != '\0');
        (void)dur;                                             // dur qua media_dur_
        strncpy(media_artist_, author ? author : "", sizeof(media_artist_) - 1);   // ca sĩ -> hiện ở dòng time (nhạc)
        media_artist_[sizeof(media_artist_) - 1] = '\0';
        // Bìa dim+gradient phủ FULL màn -> chữ đặt ở KHU ĐÁY (vùng tối). Không bìa -> chữ căn giữa trên nền đen.
        const int title_ofs = has_cover ? 58 : -34;    // GFX_ALIGN_CENTER y offset (center=180)
        const int time_ofs  = has_cover ? 96 : 6;
        const int prog_ofs  = has_cover ? 132 : 44;    // thanh progress (label ký tự ▓░) dưới dòng giờ
        // Tạo obj ảnh nền TRƯỚC MỌI label (kể cả khi chưa có bìa) -> nền luôn nằm DƯỚI chữ (z-order theo thứ tự tạo).
        disp->CreateMediaCoverObj();
        if (!has_cover) disp->HideMediaCover();                     // không bìa -> ẩn nền cũ (nếu còn); tự khoá, NGOÀI lock
        emote_lock(h);
        // Tên sách/bài (cuộn native) — chữ trắng nổi trên nền tối
        if (media_title_ == nullptr) media_title_ = emote_create_obj_by_type(h, "label", "media_title");
        if (media_title_ != nullptr) {
            gfx_label_set_font(media_title_, (void*)&vocat_vn_26);
            gfx_label_set_color(media_title_, GFX_COLOR_HEX(0xFFFFFF));
            gfx_obj_set_size(media_title_, 300, 40);
            gfx_label_set_scroll_speed(media_title_, 50);
            gfx_label_set_text(media_title_, title ? title : "");
            gfx_label_set_long_mode(media_title_, GFX_LABEL_LONG_SCROLL);
            gfx_obj_align(media_title_, GFX_ALIGN_CENTER, 0, title_ofs);
            gfx_obj_set_visible(media_title_, true);
        }
        // Giờ "đã nghe / tổng". PHẢI set_size + set_text (giống title) mới render — label không size = không hiện.
        if (media_time_ == nullptr) media_time_ = emote_create_obj_by_type(h, "label", "media_time");
        if (media_time_ != nullptr) {
            gfx_label_set_font(media_time_, (void*)&vocat_vn_26);
            gfx_label_set_color(media_time_, GFX_COLOR_HEX(0xEAF6F3));
            gfx_obj_set_size(media_time_, 300, 40);
            gfx_label_set_text(media_time_, "0:00 / 0:00");
            gfx_label_set_text_align(media_time_, GFX_TEXT_ALIGN_CENTER);
            gfx_obj_align(media_time_, GFX_ALIGN_CENTER, 0, time_ofs);
            gfx_obj_set_visible(media_time_, true);
        }
        // Thanh progress = 1 label PLAIN vẽ bằng ký tự khối (█ đã phát / ░ còn lại). Nhạc KHÔNG cần -> show_bar=false thì ẩn.
        media_bar_on_ = show_bar;
        if (show_bar) {
            if (media_bar_fg_ == nullptr) media_bar_fg_ = emote_create_obj_by_type(h, "label", "media_prog");
            if (media_bar_fg_ != nullptr) {
                gfx_label_set_font(media_bar_fg_, (void*)&vocat_vn_26);
                gfx_label_set_color(media_bar_fg_, GFX_COLOR_HEX(0x7FD1C4));
                gfx_obj_set_size(media_bar_fg_, 300, 40);
                gfx_label_set_text(media_bar_fg_, "\xE2\x96\x91\xE2\x96\x91\xE2\x96\x91\xE2\x96\x91\xE2\x96\x91\xE2\x96\x91\xE2\x96\x91\xE2\x96\x91\xE2\x96\x91\xE2\x96\x91\xE2\x96\x91\xE2\x96\x91");
                gfx_label_set_text_align(media_bar_fg_, GFX_TEXT_ALIGN_CENTER);
                gfx_obj_align(media_bar_fg_, GFX_ALIGN_CENTER, 0, prog_ofs);
                gfx_obj_set_visible(media_bar_fg_, true);
            }
        } else if (media_bar_fg_ != nullptr) {
            gfx_obj_set_visible(media_bar_fg_, false);   // nhạc: ẩn thanh progress (nếu còn từ lần phát sách)
        }
        emote_set_anim_visible(h, false);                          // ẩn mặt mèo
        emote_unlock(h);
        emote_notify_all_refresh(h);
        ESP_LOGI(TAG, "media objs: title=%d time=%d cover=%d",
                 media_title_ != nullptr, media_time_ != nullptr, has_cover);
        media_pos0_ = pos; media_dur_ = dur; media_t0_us_ = esp_timer_get_time(); media_active_ = true;
        // Ảnh nền: fetch+decode chậm -> đẩy sang task riêng (đặt media_active_ trước để task biết còn cần hiện).
        if (has_cover) {
            auto* rq = static_cast<PanelFetchReq*>(malloc(sizeof(PanelFetchReq)));
            if (rq != nullptr) {
                rq->self = this;
                snprintf(rq->url, sizeof(rq->url), "%s", cover_url);
                xTaskCreatePinnedToCore(MediaCoverFetchTask, "media_cover", 4 * 1024, rq, 5, nullptr, 0);
            }
        }
        UpdateMediaTimeLabel();
        if (media_timer_ == nullptr) {
            esp_timer_create_args_t a = {};
            a.callback = MediaTickCb; a.arg = this; a.name = "media_tick";
            esp_timer_create(&a, &media_timer_);
        }
        esp_timer_stop(media_timer_);
        esp_timer_start_periodic(media_timer_, 1000000);           // tick mỗi 1s (giờ nhảy trên máy)
        // Nhạc (không bar) -> bật visualizer; sách (có bar) -> tắt visualizer.
        if (show_bar) StopViz(); else StartViz();
    }

    void HideMedia() {
        if (!media_active_) return;
        media_active_ = false;
        StopViz();
        if (media_timer_ != nullptr) esp_timer_stop(media_timer_);
        auto* disp = dynamic_cast<emote::EmoteDisplay*>(display_);
        if (disp == nullptr) return;
        emote_handle_t h = disp->GetEmoteHandle();
        emote_lock(h);
        if (media_title_ != nullptr) gfx_obj_set_visible(media_title_, false);
        if (media_time_ != nullptr) gfx_obj_set_visible(media_time_, false);
        if (media_bar_fg_ != nullptr) gfx_obj_set_visible(media_bar_fg_, false);   // thanh progress
        emote_set_anim_visible(h, true);                           // trả mặt mèo
        emote_unlock(h);
        disp->HideMediaCover();                                    // ẩn ảnh nền media (tự khoá, gọi NGOÀI lock)
        emote_notify_all_refresh(h);
    }

    // Đóng panel (lịch/thời tiết...). Nếu ĐANG phát media -> quay về màn media (giữ ẩn mặt mèo),
    // KHÔNG bật lại mặt mèo (nếu bật thì mặt mèo chồng lên chữ media -> bug "kẹt hai mắt mèo").
    void DismissPanel() {
        auto* disp = dynamic_cast<emote::EmoteDisplay*>(display_);
        if (disp == nullptr) return;
        disp->HidePanel();                                         // ẩn ảnh panel + (mặc định) bật lại mặt mèo
        panel_active_ = false;
        if (media_active_) {                                       // còn phát -> media labels vẫn hiện, chỉ cần ẩn lại mặt mèo
            emote_handle_t h = disp->GetEmoteHandle();
            emote_lock(h);
            emote_set_anim_visible(h, false);
            emote_unlock(h);
            emote_notify_all_refresh(h);
            if (!media_bar_on_) StartViz();                        // đang phát NHẠC -> bật lại visualizer sau khi đóng panel
        }
    }

    // Đăng ký tool MCP: brain (khi user "Mèo cho xem lịch") gọi -> hiện panel của người chỉ định.
    void InitializeTools() {
        auto& mcp = McpServer::GetInstance();
        mcp.AddTool(
            "self.screen.show_panel",
            "Hiển thị trang thông tin của một người lên màn hình. Tham số person = tên người "
            "(vd Ja, Men), view = loại trang (calendar/weather/clock).",
            PropertyList({
                Property("person", kPropertyTypeString),
                Property("view", kPropertyTypeString, std::string("calendar")),
            }),
            [this](const PropertyList& properties) -> ReturnValue {
                std::string person = properties["person"].value<std::string>();
                std::string view = properties["view"].value<std::string>();
                auto* rq = static_cast<PanelFetchReq*>(malloc(sizeof(PanelFetchReq)));
                if (rq == nullptr) return false;
                rq->self = this;
                snprintf(rq->url, sizeof(rq->url), "%s/panel?person=%s&view=%s",
                         PANEL_HOST, person.c_str(), view.c_str());
                xTaskCreatePinnedToCore(PanelFetchTask, "panel_fetch", 4 * 1024, rq, 5, nullptr, 0);
                return true;
            });
        // Đóng panel -> trả màn về mặt mèo. Brain gọi khi DỪNG phát nhạc/sách (server show_panel không tự tắt).
        mcp.AddTool(
            "self.screen.hide_panel",
            "Đóng panel đang hiện trên màn hình, trả về mặt mèo. Gọi khi dừng phát nhạc/sách "
            "hoặc khi không cần hiển thị panel nữa.",
            PropertyList(),
            [this](const PropertyList&) -> ReturnValue {
                auto* disp = dynamic_cast<emote::EmoteDisplay*>(display_);
                if (disp != nullptr) disp->HidePanel();
                HideMedia();                                   // đóng cả màn media native (nếu đang hiện)
                panel_active_ = false;
                return true;
            });
        // Màn "đang phát" NATIVE (tên cuộn + giờ tick trên máy) — thay panel-ảnh cho audiobook/nhạc, khỏi refresh ảnh.
        mcp.AddTool(
            "self.screen.media_show",
            "Hiển thị màn đang phát NATIVE: tên bài/sách (chữ tự cuộn ngang) + thời gian (tự nhảy trên máy). "
            "Gọi 1 lần khi bắt đầu phát nhạc/sách nói. title=tên, pos=số giây đã phát, dur=tổng số giây, "
            "cover=URL ảnh bìa (đã resize sẵn, để trống nếu không có), bar=1 hiện thanh tiến độ (sách) / 0 ẩn (nhạc).",
            PropertyList({
                Property("title", kPropertyTypeString, std::string("")),
                Property("author", kPropertyTypeString, std::string("")),
                Property("pos", kPropertyTypeInteger, 0),
                Property("dur", kPropertyTypeInteger, 0),
                Property("cover", kPropertyTypeString, std::string("")),
                Property("bar", kPropertyTypeInteger, 1),
            }),
            [this](const PropertyList& properties) -> ReturnValue {
                std::string title = properties["title"].value<std::string>();
                std::string author = properties["author"].value<std::string>();
                int pos = properties["pos"].value<int>();
                int dur = properties["dur"].value<int>();
                std::string cover = properties["cover"].value<std::string>();
                int bar = properties["bar"].value<int>();
                ShowMedia(title.c_str(), author.c_str(), pos, dur, cover.c_str(), bar != 0);
                return true;
            });
    }

    void OnTouchStart(int x, int y) {
        touch_t0_ = (uint32_t)(esp_timer_get_time() / 1000);
        touch_sx_ = touch_lx_ = x;
        touch_sy_ = touch_ly_ = y;
    }

    void OnTouchMove(int x, int y) { touch_lx_ = x; touch_ly_ = y; }

    void OnTouchEnd() {
        int dx = touch_lx_ - touch_sx_, dy = touch_ly_ - touch_sy_;
        const int SW = 45;                                  // ngưỡng vuốt (px)
        auto& app = Application::GetInstance();
        if (abs(dx) >= SW && abs(dx) >= abs(dy)) {          // vuốt NGANG -> vào/đổi page
            if (!panel_active_) panel_n_ = 0;
            else panel_n_ += (dx < 0 ? 1 : -1);             // vuốt trái = trang kế, phải = trang trước
            FetchAndShowPanel(panel_n_);
        } else if (dy <= -SW && abs(dy) > abs(dx)) {        // vuốt LÊN -> thoát panel
            if (panel_active_) DismissPanel();
        } else {                                            // CHẠM (di chuyển nhỏ)
            if (panel_active_) {                            // đang xem panel -> chạm để thoát
                DismissPanel();
            } else if (app.GetDeviceState() == kDeviceStateStarting) {
                EnterWifiConfigMode();
            } else {
                app.ToggleChatState();                      // chạm thường = nói chuyện (như cũ)
            }
        }
    }

